"""
14.4. У папці з програмою міститься перелік текстових файлів. Реалізуйте
програму, що:
• виводить на екран вміст заданого файлу;
• коректно опрацьовує ситуацію, у випадку якщо заданий файл не
існує за вказаним розташуванням або не доступний для читання
та виводить на екран відповідне повідомлення.
"""


filename = input()

try:
    with open(filename) as f:
        s = f.read()
        print(s)

except FileNotFoundError:
    print(f"Файл {filename} не знайдено!")
except PermissionError:
    print(f"Доступ до файлу {filename} заборонено!")
except Exception as e:
    print("Виникнуло незрозуміле виключення:", e)
