"""
14.3. Нехай словник моделює стан гаманця у такий спосіб:
• значення банкноти (номінал) – це ключ, а кількість банкнот
цього номіналу – значення;
• якщо у гаманці відсутня банкнота певного номіналу, то такий
елемент відсутній у гаманці (не допускається у словнику
наявність пар типу {20:0})
Потрібно порахувати суму коштів, що міститься у гаманці.
Вважається, що перелік номіналів банкнот не відомий, крім
банкноти, що має найвищий номінал.
Розв’язати задачу потрібно використовуючи для словника лише
операцію індексування за ключем (тобто операцію взяття елемента
за ключем з допомогою оператора квадратні дужки).
"""

wallet = {1: 3, 2: 2, 3: 5, 10: 24, 25: 1, 50: 5}

s = 0
for i in range(101):
    try:
        s += wallet[i] * i
    except KeyError:
        continue

print(s)
